Revit 2027 API
PartUtils.GetAssociatedPartMaker(Document, ElementId) Method
 Gets associated PartMaker for an element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PartMaker GetAssociatedPartMaker(
	Document hostDocument,
	ElementId elementId
)
Public Shared Function GetAssociatedPartMaker (
	hostDocument As Document,
	elementId As ElementId
) As PartMaker
public:
static PartMaker^ GetAssociatedPartMaker(
	Document^ hostDocument,
	ElementId^ elementId
)
static member GetAssociatedPartMaker :
        hostDocument : Document *
        elementId : ElementId -> PartMaker
Parameters
hostDocument Document
 The document
elementId ElementId
 The id for the element to be checked for associated Parts
Return Value
PartMaker
 The PartMaker element that is making Parts for this element. null if there is no associated PartMaker.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartUtils Class
GetAssociatedPartMaker Overload
Autodesk.Revit.DB Namespace